20220824141859-aeppl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-16 Fri 17:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>AePPL</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">AePPL</h1>
<p>
<a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aeppl">https://github.com/aesara-devs/aeppl</a>
</p>

<div id="outline-container-org17c4ad4" class="outline-2">
<h2 id="org17c4ad4">Condition on transformed variables</h2>
<div class="outline-text-2" id="text-org17c4ad4">
<p>
Examples of people confused by the inability to condition on deterministic random variables:
</p>

<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="http://www.awebb.info/probability/inference/mcmc/2017/02/22/observing-functions-of-random-variables-in-pymc.html">http://www.awebb.info/probability/inference/mcmc/2017/02/22/observing-functions-of-random-variables-in-pymc.html</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://groups.google.com/g/pymc/c/gAImsliT34o">https://groups.google.com/g/pymc/c/gAImsliT34o</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://stats.stackexchange.com/questions/56543/pymc-how-can-i-define-a-function-of-two-stochastic-variables-with-no-closed-fo">https://stats.stackexchange.com/questions/56543/pymc-how-can-i-define-a-function-of-two-stochastic-variables-with-no-closed-fo</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://stackoverflow.com/questions/26397835/pymc-observed-data-for-a-sum-of-random-variables">https://stackoverflow.com/questions/26397835/pymc-observed-data-for-a-sum-of-random-variables</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://stackoverflow.com/questions/24379868/estimate-the-parameters-of-a-random-variable-which-is-the-sum-of-uniform-random?rq=1">https://stackoverflow.com/questions/24379868/estimate-the-parameters-of-a-random-variable-which-is-the-sum-of-uniform-random?rq=1</a></li>
</ul>


<p>
There are two cases:
</p>
<ol class="org-ol">
<li>Transformation that only involved a single variable, in which case we need to compute the pushforward measure;</li>
<li>Transformations that involve several random variables, in which case we need to do some random variable algebra to find a closed form solution if it exists.</li>
</ol>
</div>
</div>

<div id="outline-container-orge3e4b67" class="outline-2">
<h2 id="orge3e4b67">Links to this note</h2>
<div class="outline-text-2" id="text-orge3e4b67">
<ul class="org-ul">
<li><a href="./20220824141346-mixture_models_in_aesara.html">Mixture models in Aesara</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>